# รับข้อมูล
# 1.รับข้อมูล เป็น str
# 2.รับข้อมูล เป็น str
first_name = input("ป้อนชื่อ (ภาษาอังกฤษ)")
birth_year = input("ป้อนปีเกิด(ค.ศ)")

#แปลงข้อมูล 
# แปลงข้อมูลของ first_name [0:3] เอา 3 ตัวแรกของข้อความ และแปลงตัวหนังสือให้เป็นตัว พิมพ์เล็ก เก็บไว้ในข้อมูลของ name_part // [0:3] กำหนดค่า 3 ตัวแรกของข้อมูล /lower() แแลงเป็นตัวพิมพ์เล็ก
# แปลงข้อมูลของ birth_year [2:4] เอา 2 ตัวหลัง เก็บไว้ในข้อมูลของ year_part // [2:4] กำหนดค่า 2 ตัวหลังของข้อมูล
# นำข้อมูลของ name_part รับกับ year_part จะได้ข้อมูล username
name_part = first_name[0:3].lower()
year_part = birth_year[2:4]
username = name_part + year_part

#แสดงผลข้อมูล username
print(f"ชื่อผู้ใช้แนะนำสำหรับคุณคือ: {username}")